Data/TU_Delft_Campus_case/c_0/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

#include        "include/ABLConditions"

internalField   uniform $turbulentKE;

boundaryField
{
    x0
    {
        type            symmetry;
    }
    y0
    {
        type            atmBoundaryLayerInletK;
        z0              uniform 0.5;
        flowDir         ( 0 1 0 );
        zDir            ( 0 0 1 );
        kappa           0.41;
        Cmu             0.09;
        Uref            4.97;
        Zref            10;
        zGround         uniform 1.95;
        value           $internalField;
    }
    x1
    {
        type            symmetry;
    }
    y1
    {
        type            zeroGradient;
    }
    terrain
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    sky
    {
        type            symmetry;
    }
    Buildings
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    Water
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    Green
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
