Data/TU_Delft_Campus_case/c_0/system/surfaces.cfg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            surfaces;
libs            ("libsampling.so");

writeControl    writeTime;

surfaceFormat   vtk;
interpolationScheme cellPoint;

x (1 0 0);
y (0 1 0);
z (0 0 1);
origin (0 0 0);

cuttingPlane
{
    type         cuttingPlane;
    planeType    pointAndNormal;
    pointAndNormalDict
    {
        basePoint    $origin;
        normalVector $x;
    }
    interpolate  true;
}

isosurface
{
    type            isoSurface;
    interpolate     true;
}

patchSurface
{
    type        patch;
    interpolate true;
}

// ************************************************************************* //
